module.exports.suits = ["♦️", "♥️", "♣️", "♠️"];
module.exports.ranks = [
  "2",
  "3",
  "4",
  "5",
  "6",
  "7",
  "8",
  "9",
  "10",
  "J",
  "Q",
  "K",
  "A",
];
module.exports.SB = 10;
module.exports.BB = 20;
module.exports.help_pre_game = `Possible Commands:
--------------
♠️ pok help 
♥️ pok join
♣️ pok show
♦️ pok exit
♠️ pok start`;

module.exports.help_in_game = `Possible Commands (in game):
--------------
♠️ pok check
♥️ pok call
♣️ pok raise [raise amount]
♦️ pok fold
♠️ pok help 
♥️ pok join
♣️ pok show
♦️ pok exit
♠️ pok end`;

module.exports.deck = [
  ["♦️", "2"],
  ["♦️", "3"],
  ["♦️", "4"],
  ["♦️", "5"],
  ["♦️", "6"],
  ["♦️", "7"],
  ["♦️", "8"],
  ["♦️", "9"],
  ["♦️", "10"],
  ["♦️", "J"],
  ["♦️", "Q"],
  ["♦️", "K"],
  ["♦️", "A"],
  ["♥️", "2"],
  ["♥️", "3"],
  ["♥️", "4"],
  ["♥️", "5"],
  ["♥️", "6"],
  ["♥️", "7"],
  ["♥️", "8"],
  ["♥️", "9"],
  ["♥️", "10"],
  ["♥️", "J"],
  ["♥️", "Q"],
  ["♥️", "K"],
  ["♥️", "A"],
  ["♣️", "2"],
  ["♣️", "3"],
  ["♣️", "4"],
  ["♣️", "5"],
  ["♣️", "6"],
  ["♣️", "7"],
  ["♣️", "8"],
  ["♣️", "9"],
  ["♣️", "10"],
  ["♣️", "J"],
  ["♣️", "Q"],
  ["♣️", "K"],
  ["♣️", "A"],
  ["♠️", "2"],
  ["♠️", "3"],
  ["♠️", "4"],
  ["♠️", "5"],
  ["♠️", "6"],
  ["♠️", "7"],
  ["♠️", "8"],
  ["♠️", "9"],
  ["♠️", "10"],
  ["♠️", "J"],
  ["♠️", "Q"],
  ["♠️", "K"],
  ["♠️", "A"],
];

module.exports.fold_emojies = ["☹️", "😒", "🤒", "🤕", "😵", "😪", "😬", "😩"];
module.exports.start_emojies = ["🥹", "😎", "😋", "🥳", "🤩", "🤠", "🤗", "😛"];
